export const Countries = [
    {
        "id": 643,
        "name": "Россия"
    },
    {
        "id": 0,
        "name": "Без гражданства"
    },
    {
        "id": 895,
        "name": "Абхазия"
    },
    {
        "id": 36,
        "name": "Австралия"
    },
    {
        "id": 40,
        "name": "Австрия"
    },
    {
        "id": 31,
        "name": "Азербайджан"
    },
    {
        "id": 8,
        "name": "Албания"




    },
    {
        "id": 12,
        "name": "Алжир"
    },
    {
        "id": 16,
        "name": "Американское Самоа"




    },
    {
        "id": 660,
        "name": "Ангилья"




    },
    {
        "id": 24,
        "name": "Ангола"




    },
    {
        "id": 20,
        "name": "Андорра"




    },
    {
        "id": 10,
        "name": "Антарктида"




    },
    {
        "id": 28,
        "name": "Антигуа И Барбуда"




    },
    {
        "id": 32,
        "name": "Аргентина"




    },
    {
        "id": 51,
        "name": "Армения"




    },
    {
        "id": 533,
        "name": "Аруба"




    },
    {
        "id": 4,
        "name": "Афганистан"




    },
    {
        "id": 44,
        "name": "Багамы"




    },
    {
        "id": 50,
        "name": "Бангладеш"




    },
    {
        "id": 52,
        "name": "Барбадос"




    },
    {
        "id": 48,
        "name": "Бахрейн"




    },
    {
        "id": 112,
        "name": "Беларусь"




    },
    {
        "id": 84,
        "name": "Белиз"




    },
    {
        "id": 56,
        "name": "Бельгия"




    },
    {
        "id": 204,
        "name": "Бенин"




    },
    {
        "id": 60,
        "name": "Бермуды"




    },
    {
        "id": 100,
        "name": "Болгария"




    },
    {
        "id": 68,
        "name": "Боливия"




    },
    {
        "id": 535,
        "name": "Бонэйр, Синт-эстатиус И Саба"




    },
    {
        "id": 70,
        "name": "Босния и Герцеговина"




    },
    {
        "id": 72,
        "name": "Ботсвана"




    },
    {
        "id": 76,
        "name": "Бразилия"




    },
    {
        "id": 86,
        "name": "Британская Территория в Индийском Океане"




    },
    {
        "id": 96,
        "name": "Бруней-даруссалам"




    },
    {
        "id": 854,
        "name": "Буркина-фасо"




    },
    {
        "id": 108,
        "name": "Бурунди"




    },
    {
        "id": 64,
        "name": "Бутан"




    },
    {
        "id": 548,
        "name": "Вануату"




    },
    {
        "id": 348,
        "name": "Венгрия"




    },
    {
        "id": 862,
        "name": "Венесуэла"




    },
    {
        "id": 92,
        "name": "Виргинские Острова, Британские"




    },
    {
        "id": 850,
        "name": "Виргинские Острова, Сша"




    },
    {
        "id": 704,
        "name": "Вьетнам"




    },
    {
        "id": 266,
        "name": "Габон"




    },
    {
        "id": 332,
        "name": "Гаити"




    },
    {
        "id": 328,
        "name": "Гайана"




    },
    {
        "id": 270,
        "name": "Гамбия"




    },
    {
        "id": 288,
        "name": "Гана"




    },
    {
        "id": 312,
        "name": "Гваделупа"




    },
    {
        "id": 320,
        "name": "Гватемала"




    },
    {
        "id": 324,
        "name": "Гвинея"




    },
    {
        "id": 624,
        "name": "Гвинея-бисау"




    },
    {
        "id": 276,
        "name": "Германия"




    },
    {
        "id": 831,
        "name": "Гернси"




    },
    {
        "id": 292,
        "name": "Гибралтар"




    },
    {
        "id": 340,
        "name": "Гондурас"




    },
    {
        "id": 344,
        "name": "Гонконг"




    },
    {
        "id": 308,
        "name": "Гренада"




    },
    {
        "id": 304,
        "name": "Гренландия"




    },
    {
        "id": 300,
        "name": "Греция"




    },
    {
        "id": 268,
        "name": "Грузия"




    },
    {
        "id": 316,
        "name": "Гуам"




    },
    {
        "id": 208,
        "name": "Дания"




    },
    {
        "id": 832,
        "name": "Джерси"




    },
    {
        "id": 262,
        "name": "Джибути"




    },
    {
        "id": 212,
        "name": "Доминика"




    },
    {
        "id": 214,
        "name": "Доминиканская Республика"




    },
    {
        "id": 818,
        "name": "Египет"




    },
    {
        "id": 894,
        "name": "Замбия"




    },
    {
        "id": 732,
        "name": "Западная Сахара"




    },
    {
        "id": 716,
        "name": "Зимбабве"




    },
    {
        "id": 376,
        "name": "Израиль"




    },
    {
        "id": 356,
        "name": "Индия"




    },
    {
        "id": 360,
        "name": "Индонезия"




    },
    {
        "id": 400,
        "name": "Иордания"




    },
    {
        "id": 368,
        "name": "Ирак"




    },
    {
        "id": 364,
        "name": "Иран, Исламская Республика"




    },
    {
        "id": 372,
        "name": "Ирландия"




    },
    {
        "id": 352,
        "name": "Исландия"




    },
    {
        "id": 724,
        "name": "Испания"




    },
    {
        "id": 380,
        "name": "Италия"




    },
    {
        "id": 887,
        "name": "Йемен"




    },
    {
        "id": 132,
        "name": "Кабо-верде"




    },
    {
        "id": 398,
        "name": "Казахстан"




    },
    {
        "id": 116,
        "name": "Камбоджа"




    },
    {
        "id": 120,
        "name": "Камерун"




    },
    {
        "id": 124,
        "name": "Канада"




    },
    {
        "id": 634,
        "name": "Катар"




    },
    {
        "id": 404,
        "name": "Кения"




    },
    {
        "id": 196,
        "name": "Кипр"




    },
    {
        "id": 417,
        "name": "Киргизия"




    },
    {
        "id": 296,
        "name": "Кирибати"




    },
    {
        "id": 156,
        "name": "Китай"




    },
    {
        "id": 166,
        "name": "Кокосовые (килинг) Острова"




    },
    {
        "id": 170,
        "name": "Колумбия"




    },
    {
        "id": 174,
        "name": "Коморы"




    },
    {
        "id": 178,
        "name": "Конго"




    },
    {
        "id": 180,
        "name": "Конго, Демократическая Республика"




    },
    {
        "id": 408,
        "name": "Корея, Народно-демократическая Республика"




    },
    {
        "id": 410,
        "name": "Республика Корея"




    },
    {
        "id": 188,
        "name": "Республика Коста-рика"




    },
    {
        "id": 384,
        "name": "Республика Кот Д'ивуар"




    },
    {
        "id": 192,
        "name": "Республика Куба"




    },
    {
        "id": 414,
        "name": "Государство Кувейт"




    },
    {
        "id": 531,
        "name": "Кюрасао"




    },
    {
        "id": 418,
        "name": "Лаосская Народно-демократическая Республика"




    },
    {
        "id": 428,
        "name": "Латвийская Республика"




    },
    {
        "id": 426,
        "name": "Королевство Лесото"




    },
    {
        "id": 430,
        "name": "Республика Либерия"




    },
    {
        "id": 422,
        "name": "Ливанская Республика"




    },
    {
        "id": 434,
        "name": "Ливия"




    },
    {
        "id": 440,
        "name": "Литовская Республика"




    },
    {
        "id": 438,
        "name": "Княжество Лихтенштейн"




    },
    {
        "id": 442,
        "name": "Великое Герцогство Люксембург"




    },
    {
        "id": 480,
        "name": "Республика Маврикий"




    },
    {
        "id": 478,
        "name": "Исламская Республика Мавритания"




    },
    {
        "id": 450,
        "name": "Республика Мадагаскар"




    },
    {
        "id": 175,
        "name": "Майотта"




    },
    {
        "id": 446,
        "name": "Макао"




    },
    {
        "id": 807,
        "name": "Республика Македония"




    },
    {
        "id": 454,
        "name": "Республика Малави"




    },
    {
        "id": 458,
        "name": "Малайзия"




    },
    {
        "id": 466,
        "name": "Республика Мали"




    },
    {
        "id": 581,
        "name": "Малые Тихоокеанские Отдаленные Острова Сша"




    },
    {
        "id": 462,
        "name": "Мальдивская Республика"




    },
    {
        "id": 470,
        "name": "Республика Мальта"




    },
    {
        "id": 504,
        "name": "Королевство Марокко"




    },
    {
        "id": 474,
        "name": "Мартиника"




    },
    {
        "id": 584,
        "name": "Республика Маршалловы Острова"




    },
    {
        "id": 484,
        "name": "Мексиканские Соединенные Штаты"




    },
    {
        "id": 583,
        "name": "Федеративные Штаты Микронезии"




    },
    {
        "id": 508,
        "name": "Республика Мозамбик"




    },
    {
        "id": 498,
        "name": "Республика Молдова"




    },
    {
        "id": 492,
        "name": "Княжество Монако"




    },
    {
        "id": 496,
        "name": "Монголия"




    },
    {
        "id": 500,
        "name": "Монтсеррат"




    },
    {
        "id": 104,
        "name": "Республика Союза Мьянма"




    },
    {
        "id": 516,
        "name": "Республика Намибия"




    },
    {
        "id": 520,
        "name": "Республика Науру"




    },
    {
        "id": 524,
        "name": "Непал"




    },
    {
        "id": 562,
        "name": "Республика Нигер"




    },
    {
        "id": 566,
        "name": "Федеративная Республика Нигерия"




    },
    {
        "id": 528,
        "name": "Королевство Нидерландов"




    },
    {
        "id": 558,
        "name": "Республика Никарагуа"




    },
    {
        "id": 570,
        "name": "Ниуэ"




    },
    {
        "id": 554,
        "name": "Новая Зеландия"




    },
    {
        "id": 540,
        "name": "Новая Каледония"




    },
    {
        "id": 578,
        "name": "Королевство Норвегия"




    },
    {
        "id": 784,
        "name": "Объединенные Арабские Эмираты"




    },
    {
        "id": 512,
        "name": "Султанат Оман"




    },
    {
        "id": 136,
        "name": "Острова Кайман"




    },
    {
        "id": 184,
        "name": "Острова Кука"




    },
    {
        "id": 796,
        "name": "Острова Теркс И Кайкос"




    },
    {
        "id": 74,
        "name": "Остров Буве"




    },
    {
        "id": 833,
        "name": "Остров Мэн"




    },
    {
        "id": 574,
        "name": "Остров Норфолк"




    },
    {
        "id": 162,
        "name": "Остров Рождества"




    },
    {
        "id": 334,
        "name": "Остров Херд И Острова Макдональд"




    },
    {
        "id": 586,
        "name": "Исламская Республика Пакистан"




    },
    {
        "id": 585,
        "name": "Республика Палау"




    },
    {
        "id": 275,
        "name": "Государство Палестина"




    },
    {
        "id": 591,
        "name": "Республика Панама"




    },
    {
        "id": 336,
        "name": "Государство - Город Ватикан"




    },
    {
        "id": 598,
        "name": "Папуа Новая Гвинея"




    },
    {
        "id": 600,
        "name": "Республика Парагвай"




    },
    {
        "id": 604,
        "name": "Республика Перу"




    },
    {
        "id": 612,
        "name": "Питкерн"




    },
    {
        "id": 616,
        "name": "Республика Польша"




    },
    {
        "id": 620,
        "name": "Португальская Республика"




    },
    {
        "id": 630,
        "name": "Пуэрто-рико"




    },
    {
        "id": 638,
        "name": "Реюньон"




    },
    {
        "id": 646,
        "name": "Руандийская Республика"




    },
    {
        "id": 642,
        "name": "Румыния"




    },
    {
        "id": 882,
        "name": "Независимое Государство Самоа"




    },
    {
        "id": 674,
        "name": "Республика Сан-марино"




    },
    {
        "id": 678,
        "name": "Сан-томе И Принсипи"




    },
    {
        "id": 682,
        "name": "Королевство Саудовская Аравия"




    },
    {
        "id": 748,
        "name": "Королевство Свазиленд"




    },
    {
        "id": 654,
        "name": "Святая Елена, Остров Вознесения, Тристан-да-кунья"




    },
    {
        "id": 580,
        "name": "Северные Марианские Острова"




    },
    {
        "id": 690,
        "name": "Республика Сейшелы"




    },
    {
        "id": 652,
        "name": "Сен-бартелеми"




    },
    {
        "id": 663,
        "name": "Сен-мартен"




    },
    {
        "id": 534,
        "name": "Сен-мартен (нидерландская часть)",




    },
    {
        "id": 686,
        "name": "Республика Сенегал"




    },
    {
        "id": 670,
        "name": "Сент-винсент И Гренадины"




    },
    {
        "id": 659,
        "name": "Сент-китс И Невис"




    },
    {
        "id": 662,
        "name": "Сент-люсия"




    },
    {
        "id": 666,
        "name": "Сент-пьер И Микелон"




    },
    {
        "id": 688,
        "name": "Республика Сербия"




    },
    {
        "id": 702,
        "name": "Республика Сингапур"




    },
    {
        "id": 760,
        "name": "Сирийская Арабская Республика"




    },
    {
        "id": 703,
        "name": "Словацкая Республика"




    },
    {
        "id": 705,
        "name": "Республика Словения"




    },
    {
        "id": 826,
        "name": "Соединенное Королевство"




    },
    {
        "id": 840,
        "name": "Сша"




    },
    {
        "id": 90,
        "name": "Соломоновы Острова"




    },
    {
        "id": 706,
        "name": "Федеративная Республика Сомали"




    },
    {
        "id": 729,
        "name": "Республика Судан"




    },
    {
        "id": 740,
        "name": "Республика Суринам"




    },
    {
        "id": 694,
        "name": "Республика Сьерра-леоне"




    },
    {
        "id": 762,
        "name": "Республика Таджикистан"




    },
    {
        "id": 764,
        "name": "Королевство Таиланд"




    },
    {
        "id": 158,
        "name": "Тайвань (китай)",




    },
    {
        "id": 834,
        "name": "Объединенная Республика Танзания"




    },
    {
        "id": 626,
        "name": "Тимор-лесте"




    },
    {
        "id": 768,
        "name": "Тоголезская Республика"




    },
    {
        "id": 772,
        "name": "Токелау"




    },
    {
        "id": 776,
        "name": "Королевство Тонга"




    },
    {
        "id": 780,
        "name": "Республика Тринидад и Тобаго"




    },
    {
        "id": 798,
        "name": "Тувалу"




    },
    {
        "id": 788,
        "name": "Тунисская Республика"




    },
    {
        "id": 795,
        "name": "Туркменистан"




    },
    {
        "id": 792,
        "name": "Турция"




    },
    {
        "id": 800,
        "name": "Республика Уганда"




    },
    {
        "id": 860,
        "name": "Узбекистан"
    },
    {
        "id": 804,
        "name": "Украина"
    },
    {
        "id": 876,
        "name": "Уоллис И Футуна"
    },
    {
        "id": 858,
        "name": "Уругвай"
    },
    {
        "id": 234,
        "name": "Фарерские Острова"
    },
    {
        "id": 242,
        "name": "Республика Фиджи"
    },
    {
        "id": 608,
        "name": "Республика Филиппины"
    },
    {
        "id": 246,
        "name": "Финляндская Республика"
    },
    {
        "id": 238,
        "name": "Фолклендские Острова (мальвинские)",
    },
    {
        "id": 250,
        "name": "Французская Республика"
    },
    {
        "id": 254,
        "name": "Французская Гвиана"
    },
    {
        "id": 258,
        "name": "Французская Полинезия"
    },
    {
        "id": 260,
        "name": "Французские Южные Территории"
    },
    {
        "id": 191,
        "name": "Республика Хорватия"
    },
    {
        "id": 140,
        "name": "Центрально-африканская Республика"
    },
    {
        "id": 148,
        "name": "Республика Чад"
    },
    {
        "id": 499,
        "name": "Черногория"
    },
    {
        "id": 203,
        "name": "Чешская Республика"
    },
    {
        "id": 152,
        "name": "Республика Чили"
    },
    {
        "id": 756,
        "name": "Швейцарская Конфедерация"
    },
    {
        "id": 752,
        "name": "Королевство Швеция"
    },
    {
        "id": 744,
        "name": "Шпицберген и Ян Майен"
    },
    {
        "id": 144,
        "name": "Шри-ланка"
    },
    {
        "id": 218,
        "name": "Республика Эквадор"
    },
    {
        "id": 226,
        "name": "Экваториальная Гвинея"
    },
    {
        "id": 248,
        "name": "Эландские Острова"
    },
    {
        "id": 222,
        "name": "Республика Эль-сальвадор"
    },
    {
        "id": 232,
        "name": "Государство Эритрея"
    },
    {
        "id": 233,
        "name": "Эстония"
    },
    {
        "id": 231,
        "name": "Эфиопия"
    },
    {
        "id": 710,
        "name": "Южно-африканская Республика"
    },
    {
        "id": 239,
        "name": "Южная Джорджия и Южные Сандвичевы Острова"
    },
    {
        "id": 896,
        "name": "Республика Южная Осетия"
    },
    {
        "id": 728,
        "name": "Республика Южный Судан"
    },
    {
        "id": 388,
        "name": "Ямайка"
    },
    {
        "id": 392,
        "name": "Япония"
    }
]