import { InMemoryDbService } from 'angular-in-memory-web-api';
import { RelationType, Countries, IdentityCardType, SpecHealth } from './shared/index';
import { EnumToArrayPipe } from './shared/enum-to-array-pipe';

export class InMemoryService implements InMemoryDbService {
  createDb() {
    let heroes = [
      { id: 1, name: 'Windstorm' },
      { id: 2, name: 'Bombasto' },
      { id: 3, name: 'Magneta' },
      { id: 4, name: 'Tornado' }
    ];
    let identityCardTypes = new EnumToArrayPipe().transform(IdentityCardType.values(), IdentityCardType);
    let relationTypes = [
      new RelationType("26B732C2-580D-4FCC-8034-A88F01009735", "Отец", false),
      new RelationType("4575BF75-EF7C-4A82-B8F5-A88F01009735", "Мать", false),
      new RelationType("2DD2F703-28C6-407A-AC59-A8BE0119991A", "Опекун", false),
      new RelationType("72DAF54C-3C97-41F0-B0DB-A89200AEED55", "Законный представитель", true)
    ];
    let specHealths = [
      {
        "code": 101,
        "name": "Без ограничений",
      },
      {
        "code": 102,
        "name": "Общее недоразвитие речи (ОНР)",
      },
      {
        "code": 103,
        "name": "Нарушение зрения",
        "id": "d69f8a0b-7d6f-4796-804a-a88f01009733",

      },
      {
        "code": 104,
        "name": "Нарушения интеллекта",
        "id": "aa9e17ac-2cab-4864-82d6-a88f01009733",

      },
      {
        "code": 105,
        "name": "Нарушения с ОДА",
        "id": "751afcc5-26a1-475e-9d62-a88f01009733",

      },
      {
        "code": 106,
        "name": "Туберкулезная интоксикация",
        "id": "2c316153-7225-46e4-abf8-a88f01009733",

      },
      {
        "code": 107,
        "name": "Часто болеющие дети (ЧБД)",
        "id": "700069bf-9101-4805-90bd-a88f01009733",

      },
      {
        "code": 108,
        "name": "Умственно отсталые",
        "id": "02851fe5-d395-4f1e-ad7d-a88f01009733",
      },
      {
        "code": 109,
        "name": "Задержка умственного развития (ЗПР)",
        "id": "910613b5-875e-4fc1-8ba0-a88f01009733",

      },
      {
        "code": 110,
        "name": "Заикание",
        "id": "35faebb6-1041-4cd6-a327-a88f01009733",

      },
      {
        "code": 111,
        "name": "Фонетико-фонематическое недоразвитие (ФФН)",
        "id": "d49fbd54-8736-4f15-924e-a88f01009733",

      },
      {
        "code": 112,
        "name": "Детский церебральный паралич (ДЦП)",
        "id": "6e7fc16f-6ecf-4733-80ed-a88f01009733",

      },
      {
        "code": 113,
        "name": "Нарушения слуха",
        "id": "b17c3169-c970-4a9c-9a6d-a88f01009733",

      },
      {
        "code": 114,
        "name": "Сахарный диабет",
        "id": "d8f230ad-5e97-4e9a-92e6-a88f01009733",

      },
      {
        "code": 115,
        "name": "Неспецифические заболевания органов дыхания",
        "id": "209833e0-0b6f-46b9-bc4b-a88f01009734",

      },
      {
        "code": 116,
        "name": "Заболевания сердечно-сосудистой системы",
        "id": "bb16639c-a62a-4def-960a-a88f01009734",

      },
      {
        "code": 117,
        "name": "Нефро-урологические заболевания",
        "id": "5ec8651b-c746-46b3-8e39-a88f01009734",

      },
      {
        "code": 118,
        "name": "Неврологические заболевания",
        "id": "7e8eda56-7227-4cd4-8896-a88f01009734",

      },
      {
        "code": 119,
        "name": "Заболевание целиакией",
        "id": "eca54fd7-7579-4c22-921c-a88f01009734",

      },
      {
        "code": 120,
        "name": "Сложный дефект",
        "id": "9e3ed39d-8873-496e-89e2-a88f01009734",

      },
      {
        "code": 121,
        "name": "Аллергопатология",
        "id": "05154e74-f4f2-4a62-9fdc-a88f01009734",

      },
      {
        "code": 122,

        "name": "ОНР: 1 уровень",
        "id": "982907a9-87b0-409d-9433-a88f01009734",

      },
      {
        "code": 123,
        "name": "ОНР: 2 уровень",
        "id": "5a16e58d-edbb-4a8a-93db-a88f01009734",

      },
      {
        "code": 124,
        "name": "ОНР: 3 уровень",
        "id": "3cf1a401-52d5-4cac-b04b-a88f01009734",

      },
      {
        "code": 125,
        "name": "Нарушения интеллектуального развития: умственная отсталость в легкой степени",
        "id": "7cbadfaf-baa2-46ad-bbad-a88f01009734",

      },
      {
        "code": 126,
        "name": "Нарушения интеллектуального развития: умственная отсталость средней и тяжелой степени",
        "id": "25efad83-242b-46b7-a869-a88f01009734",

      },
      {
        "code": 127,
        "name": "Нарушения зрения: врожденные патологии, приводящие к слепоте и слабовидению",
        "id": "624f7494-9db3-4a95-be9d-a88f01009734",

      },
      {
        "code": 128,
        "name": "Нарушения зрения: косоглазие",
        "id": "6aa8a661-d617-45f6-b1cd-a88f01009734",

      },
      {
        "code": 129,
        "name": "Нарушения зрения: амблиопия",
        "id": "2f0d7ee7-1cef-437e-95db-a88f01009734",

      },
      {
        "code": 130,
        "name": "Нарушения ОДА: врожденные патологии тяжелой степени",
        "id": "da577a96-3988-4d3d-ba43-a88f01009734",

      },
      {
        "code": 131,
        "name": "Нарушения ОДА: заболевания средней степени тяжести",
        "id": "7a2c6452-dc48-4ab4-af53-a88f01009734",

      },
      {
        "code": 132,
        "name": "Нарушения ОДА: заболевания легкой степени тяжести",
        "id": "ae0f1502-1558-4c42-b702-a88f01009734",

      },
      {
        "code": 133,
        "name": "Нарушения ОДА: заболевания, осложненные ДЦП",
        "id": "51bb3279-b899-4555-8b24-a88f01009734",

      },
      {
        "code": 134,
        "name": "Нарушения слуха: врожденные патологии, приводящие к глухоте",
        "id": "0219fab5-2646-485e-a5da-a88f01009734",

      },
      {
        "code": 135,
        "name": "Нарушения слуха: заболевания, приводящие к тугоухости",
        "id": "aa5d0e9c-0f30-4aec-87be-a88f01009734"
      },
      {
        "code": 136,
        "name": "Нарушения слуха: заболевания средней и легкой степени тяжести",
        "id": "57a95c32-2369-45d3-8baa-a88f01009734"
      },
      {
        "code": 137,
        "name": "Задержка речевого развития (ЗРР)",
        "id": "d08febba-099f-48e7-84cf-a88f01009734"
      },
      {
        "code": 140,
        "name": "Другие, с необходимостью комплексных оздоровительных мероприятий",
        "id": "93a8d589-1e86-4147-9ea6-f1e8083ccc6e",

      },
      {
        "code": 141,
        "name": "С иными физическими ограничениями",
        "id": "767f6651-7de7-482c-8725-1c0324f50f54",
      },
      {
        "code": 142,
        "name": "Дети с тяжелым нарушением речи",
        "id": "2eb5398c-6846-4e4f-ad75-7176ef6d428d",

      },
      {
        "code": 143,
        "name": "С задержкой психического развития",
        "id": "35ac881f-8053-49f3-9dfb-fdfa47b58708",

      }
    ];
    
    return {
      heroes: heroes,
      countries: Countries,
      relationTypes: relationTypes,
      identityCardTypes: identityCardTypes,
      specHealths: specHealths
    };
  }
}